In [6]:
import pandas as pd

In [8]:
!pwd

/Users/manonlaffly/code/cobergmann/MA_PREDICTOR/notebooks

In [11]:
TRBC_industry = pd.read_csv('../raw_data/hierarchical_ids_by_industries.csv')

In [12]:
TRBC_industry

,Unnamed: 0,industries,hierarchal ID,Unnamed: 3
0,0,Coal,50101010,NaN
1,1,Integrated Oil & Gas,50102010,NaN
2,2,Oil & Gas Exploration and Production,50102020,NaN
3,3,Oil & Gas Refining and Marketing,50102030,NaN
4,4,Oil & Gas Drilling,50103010,NaN
...,...,...,...,...
148,148,Government Administration Activities,62101030,NaN
149,149,National Security & International Affairs,62101040,NaN
150,150,Miscellaneous Educational Service Providers,63101010,NaN
151,151,"School, College & University",63102010,NaN
152,152,Professional & Business Education,63103010,_

In [ ]:
!pwd

/Users/manonlaffly/code/cobergmann/MA_PREDICTOR/notebooks

In [13]:
del TRBC_industry['Unnamed: 0']

In [15]:
del TRBC_industry['Unnamed: 3']

In [17]:
TRBC_industry = TRBC_industry.rename(columns={'hierarchal ID': 'Hierarchical_Code',
                                              'industries': 'Title'})

In [18]:
TRBC_industry

                                           Title  Hierarchical_Code
0                                           Coal           50101010
1                           Integrated Oil & Gas           50102010
2           Oil & Gas Exploration and Production           50102020
3               Oil & Gas Refining and Marketing           50102030
4                             Oil & Gas Drilling           50103010
..                                           ...                ...
148         Government Administration Activities           62101030
149    National Security & International Affairs           62101040
150  Miscellaneous Educational Service Providers           63101010
151                 School, College & University           63102010
152            Professional & Business Education           63103010

[153 rows x 2 columns]

In [19]:
TRBC_industry.dtypes

Title                object
Hierarchical_Code     int64
dtype: object

In [20]:
TRBC_industry.to_pickle('../MA_PREDICTOR/data/trbc.pkl')
print('Saved as trbc.pkl')

Saved as trbc.pkl